Manifold/OpenFOAM_File/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 10 0);

boundaryField
{
        
    inlet
    {
        type      fixedValue  ;
        value     uniform  ( 0 10 0) ; 
    }

    outlet1
    {
        type  zeroGradient ;
    }

    outlet2
    {
        $outlet1 ;
    }

    outlet3
    {
        $outlet1 ;
    }


    wall-volume_volume
    {
        type      noSlip ;
    }
}




// ************************************************************************* //
